# Create Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..Create Method
MultistoryStairs Class See Also
---
Creates a multistory stairs from an existing component-based stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static MultistoryStairs Create(
	Stairs stairs
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	stairs As Stairs _
) As MultistoryStairs
```

Visual C++
---
```text
public:
static MultistoryStairs^ Create(
	Stairs^ stairs
)
```

# ### Parameters
stairs
    Type: Autodesk.Revit.DB.Architecture..::..Stairs A component-based stairs.
# ### Return Value
The newly created element. Use [M:Autodesk.Revit.DB.Architecture.MultistoryStairs.ConnectLevels(System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})] to extend this to multiple stories and generate stairs groups for each level height.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace